bhanuprakashjh/ProjectGaruda/dspic33AKESC/hal/hal_pwm.c
    PG1PHASEbits.PHASE = MIN_DUTY;
    PG1DCbits.DC = MIN_DUTY;
    PG1DCA      = 0x0000;
    PG1PER      = 0x0000;
    PG1DTbits.DTH = DEADTIME_COUNTS;
    PG1DTbits.DTL = DEADTIME_COUNTS;

    PG1TRIGAbits.CAHALF = 0;
    PG1TRIGAbits.TRIGA = ADC_SAMPLING_POINT;
    PG1TRIGB    = 0x0000;
    PG1TRIGC    = 0x0000;
}

/**
 * @brief Configure PWM Generator 2 (Phase B) — Slave to PG1.
 */
void InitPWMGenerator2(void)
{
    PG2CON      = 0x0000;
    PG2CONbits.ON = 0;
    PG2CONbits.CLKSEL = 1;
    PG2CONbits.MODSEL = 4;         /* Center-Aligned PWM */
    PG2CONbits.TRGCNT = 0;
    PG2CONbits.MDCSEL = 0;
    PG2CONbits.MPERSEL = 1;
    PG2CONbits.MPHSEL = 0;
    PG2CONbits.MSTEN = 0;          /* Not master */
    PG2CONbits.UPDMOD = 0b010;     /* Slaved SOC update */
    PG2CONbits.TRGMOD = 0;
    PG2CONbits.SOCS = 1;           /* Triggered by PG1 */

    PG2STAT     = 0x0000;
    PG2IOCON    = 0x0000;

    PG2IOCONbits.CLMOD = 0;
    PG2IOCONbits.SWAP = 0;
    PG2IOCONbits.OVRENH = 1;
    PG2IOCONbits.OVRENL = 1;
    PG2IOCONbits.OVRDAT = 0;
    PG2IOCONbits.OSYNC = 0;
    PG2IOCONbits.FLTDAT = 0;
    PG2IOCONbits.CLDAT = 0;
    PG2IOCONbits.FFDAT = 0;
    PG2IOCONbits.DBDAT = 0;

    PG2IOCONbits.CAPSRC = 0;
    PG2IOCONbits.DTCMPSEL = 0;
    PG2IOCONbits.PMOD = 0;
    PG2IOCONbits.PENH = 1;
    PG2IOCONbits.PENL = 1;
    PG2IOCONbits.POLH = 0;
    PG2IOCONbits.POLL = 0;

    PG2EVT      = 0x0000;
    PG2EVTbits.ADTR1PS = 0;
    PG2EVTbits.ADTR1EN3 = 0;
    PG2EVTbits.ADTR1EN2 = 0;
    PG2EVTbits.ADTR1EN1 = 0;
    PG2EVTbits.UPDTRG = 1;         /* DC write triggers UPDATE (fix: slave wasn't loading duty) */
    PG2EVTbits.PGTRGSEL = 0;
    PG2EVTbits.FLTIEN = 0;
    PG2EVTbits.CLIEN = 0;
    PG2EVTbits.FFIEN = 0;
    PG2EVTbits.SIEN = 0;
    PG2EVTbits.IEVTSEL = 3;
    PG2EVTbits.ADTR2EN3 = 0;
    PG2EVTbits.ADTR2EN2 = 0;
    PG2EVTbits.ADTR2EN1 = 0;
    PG2EVTbits.ADTR1OFS = 0;

#ifdef ENABLE_PWM_FAULT_PCI
    /* LEB-gated FPCI acceptance — see PG1 comment */
    PG2FPCI     = 0x0000;
    PG2FPCIbits.TSYNCDIS = 0;
    PG2FPCIbits.TERM = 1;
    PG2FPCIbits.AQPS = 1;           /* Inverted: accept when LEB LOW */
    PG2FPCIbits.AQSS = 0b010;       /* LEB as acceptance qualifier */
    PG2FPCIbits.PSYNC = 0;
    PG2FPCIbits.PPS = 1;
    PG2FPCIbits.PSS = 0b01000;      /* RPn input (PCI8R = board U25B) */
    PG2FPCIbits.BPEN = 0;
    PG2FPCIbits.BPSEL = 0;
    PG2FPCIbits.TERMPS = 0;
    PG2FPCIbits.ACP = 3;
    PG2FPCIbits.LATMOD = 0;
    PG2FPCIbits.TQPS = 0;
    PG2FPCIbits.TQSS = 0;
#if FEATURE_HW_OVERCURRENT && OC_PROTECT_MODE == 1
    PG2FPCIbits.PSS = 0b11101;      /* CMP3 (replaces RPn/PCI8R) */
    PG2FPCIbits.PPS = 0;            /* Non-inverted */
#endif
#else
    /* FOC: FPCI disabled via LEB qualifier gating (see PG1 comment) */
    PG2FPCI     = 0x0000;
    PG2FPCIbits.ACP  = 1;
    PG2FPCIbits.AQSS = 0b010;
    PG2FPCIbits.AQPS = 0;
    PG2FPCIbits.TERM = 1;
#endif

#if FEATURE_HW_OVERCURRENT && (OC_PROTECT_MODE == 0 || OC_PROTECT_MODE == 2) && OC_CLPCI_ENABLE
    PG2CLPCI    = 0x0000;
    PG2CLPCIbits.PSS = 0b11101;    /* Comparator 3 output */
    PG2CLPCIbits.PPS = 0;
    PG2CLPCIbits.TERM = 1;
    PG2CLPCIbits.ACP = 0b011;     /* Latched acceptance (recommended with LEB) */
    PG2CLPCIbits.PSYNC = 0;
    PG2CLPCIbits.AQSS = 0b010;    /* LEB active as acceptance qualifier */
    PG2CLPCIbits.AQPS = 1;        /* Inverted: accept only when LEB inactive */
#else
    PG2CLPCI    = 0x0000;
#endif
    PG2FFPCI    = 0x0000;
    PG2SPCI     = 0x0000;
    /* LEB counter — see PG1 comment. Required for FPCI qualifier. */
#if FEATURE_HW_OVERCURRENT
    PG2LEB      = 0x0000;
    PG2LEBbits.PHR = 1;
    PG2LEBbits.PHF = 1;
    PG2LEBbits.PLR = 1;
    PG2LEBbits.PLF = 1;
    PG2LEBbits.LEB = OC_LEB_COUNTS;
#else
    PG2LEB      = 0x0000;
#endif

    PG2PHASEbits.PHASE = MIN_DUTY;
    PG2DCbits.DC = MIN_DUTY;
    PG2DCA      = 0x0000;
    PG2PER      = 0x0000;
    PG2DTbits.DTH = DEADTIME_COUNTS;
    PG2DTbits.DTL = DEADTIME_COUNTS;

    PG2TRIGA    = 0x0000;
    PG2TRIGB    = 0x0000;
    PG2TRIGC    = 0x0000;
}

/**
 * @brief Configure PWM Generator 3 (Phase C) — Slave to PG1.
 */
void InitPWMGenerator3(void)
{
    PG3CON      = 0x0000;
    PG3CONbits.ON = 0;
    PG3CONbits.CLKSEL = 1;
    PG3CONbits.MODSEL = 4;
    PG3CONbits.TRGCNT = 0;
    PG3CONbits.MDCSEL = 0;
    PG3CONbits.MPERSEL = 1;
    PG3CONbits.MPHSEL = 0;
    PG3CONbits.MSTEN = 0;
    PG3CONbits.UPDMOD = 0b010;
    PG3CONbits.TRGMOD = 0;
    PG3CONbits.SOCS = 1;

    PG3STAT     = 0x0000;
    PG3IOCON    = 0x0000;

    PG3IOCONbits.CLMOD = 0;
    PG3IOCONbits.SWAP = 0;
    PG3IOCONbits.OVRENH = 1;
    PG3IOCONbits.OVRENL = 1;
    PG3IOCONbits.OVRDAT = 0;
    PG3IOCONbits.OSYNC = 0;
    PG3IOCONbits.FLTDAT = 0;
    PG3IOCONbits.CLDAT = 0;
    PG3IOCONbits.FFDAT = 0;
    PG3IOCONbits.DBDAT = 0;

    PG3IOCONbits.CAPSRC = 0;
    PG3IOCONbits.DTCMPSEL = 0;
    PG3IOCONbits.PMOD = 0;
    PG3IOCONbits.PENH = 1;
    PG3IOCONbits.PENL = 1;
    PG3IOCONbits.POLH = 0;
    PG3IOCONbits.POLL = 0;

    PG3EVT      = 0x0000;
    PG3EVTbits.ADTR1PS = 0;
    PG3EVTbits.ADTR1EN3 = 0;
    PG3EVTbits.ADTR1EN2 = 0;
    PG3EVTbits.ADTR1EN1 = 0;
    PG3EVTbits.UPDTRG = 1;         /* DC write triggers UPDATE (fix: slave wasn't loading duty) */
    PG3EVTbits.PGTRGSEL = 0;
    PG3EVTbits.FLTIEN = 0;
    PG3EVTbits.CLIEN = 0;
    PG3EVTbits.FFIEN = 0;
    PG3EVTbits.SIEN = 0;
    PG3EVTbits.IEVTSEL = 3;
    PG3EVTbits.ADTR2EN3 = 0;
    PG3EVTbits.ADTR2EN2 = 0;
    PG3EVTbits.ADTR2EN1 = 0;
    PG3EVTbits.ADTR1OFS = 0;

#ifdef ENABLE_PWM_FAULT_PCI
    /* LEB-gated FPCI acceptance — see PG1 comment */
    PG3FPCI     = 0x0000;
    PG3FPCIbits.TSYNCDIS = 0;
    PG3FPCIbits.TERM = 1;
    PG3FPCIbits.AQPS = 1;           /* Inverted: accept when LEB LOW */
    PG3FPCIbits.AQSS = 0b010;       /* LEB as acceptance qualifier */
    PG3FPCIbits.PSYNC = 0;
    PG3FPCIbits.PPS = 1;
    PG3FPCIbits.PSS = 0b01000;      /* RPn input (PCI8R = board U25B) */
    PG3FPCIbits.BPEN = 0;
    PG3FPCIbits.BPSEL = 0;
    PG3FPCIbits.TERMPS = 0;
    PG3FPCIbits.ACP = 3;
    PG3FPCIbits.LATMOD = 0;
    PG3FPCIbits.TQPS = 0;
    PG3FPCIbits.TQSS = 0;
#if FEATURE_HW_OVERCURRENT && OC_PROTECT_MODE == 1
    PG3FPCIbits.PSS = 0b11101;      /* CMP3 (replaces RPn/PCI8R) */
    PG3FPCIbits.PPS = 0;            /* Non-inverted */
#endif
#else
    /* FOC: FPCI disabled via LEB qualifier gating (see PG1 comment) */
    PG3FPCI     = 0x0000;
    PG3FPCIbits.ACP  = 1;
    PG3FPCIbits.AQSS = 0b010;
    PG3FPCIbits.AQPS = 0;
    PG3FPCIbits.TERM = 1;
#endif

#if FEATURE_HW_OVERCURRENT && (OC_PROTECT_MODE == 0 || OC_PROTECT_MODE == 2) && OC_CLPCI_ENABLE
    PG3CLPCI    = 0x0000;
    PG3CLPCIbits.PSS = 0b11101;    /* Comparator 3 output */
    PG3CLPCIbits.PPS = 0;
    PG3CLPCIbits.TERM = 1;
    PG3CLPCIbits.ACP = 0b011;     /* Latched acceptance (recommended with LEB) */
    PG3CLPCIbits.PSYNC = 0;
    PG3CLPCIbits.AQSS = 0b010;    /* LEB active as acceptance qualifier */
    PG3CLPCIbits.AQPS = 1;        /* Inverted: accept only when LEB inactive */
#else
    PG3CLPCI    = 0x0000;
#endif
    PG3FFPCI    = 0x0000;
    PG3SPCI     = 0x0000;
    /* LEB counter — see PG1 comment. Required for FPCI qualifier. */
#if FEATURE_HW_OVERCURRENT
    PG3LEB      = 0x0000;
    PG3LEBbits.PHR = 1;
    PG3LEBbits.PHF = 1;
    PG3LEBbits.PLR = 1;
    PG3LEBbits.PLF = 1;
    PG3LEBbits.LEB = OC_LEB_COUNTS;
#else
    PG3LEB      = 0x0000;
#endif

    PG3PHASEbits.PHASE = MIN_DUTY;
    PG3DCbits.DC = MIN_DUTY;
    PG3DCA      = 0x0000;
    PG3PER      = 0x0000;
    PG3DTbits.DTH = DEADTIME_COUNTS;
    PG3DTbits.DTL = DEADTIME_COUNTS;

    PG3TRIGA    = 0x0000;
    PG3TRIGB    = 0x0000;
    PG3TRIGC    = 0x0000;
}

/* Precomputed full-word PGxIOCON patterns for 6-step commutation.
 *
 * Preserves init-time bits PENH=1 (bit19) and PENL=1 (bit18) → 0x000C0000.
 * Lower 16 bits select the override mode:
 *   OVRENH  = bit13
 *   OVRENL  = bit12
 *   OVRDAT  = bits[11:10]  (bit11 = H data, bit10 = L data)
 *
 * Atomic 32-bit SFR write = 1 instruction cycle (10 ns).
 * Replaces 2-3 read-modify-write bit-field ops (~30 ns each) with a single
 * store, cutting inter-phase skew from ~90 ns to ~30 ns across all three PGs.
 * The reduced skew is what prevents 24 V · (di/dt) transient spikes from
 * crossing the 22 A board fault threshold during a sector transition.
 */
#define PG_IOCON_KEEP        0x000C0000U  /* PENH=1, PENL=1 */
#define PG_IOCON_PWM_ACTIVE  (PG_IOCON_KEEP | 0x00000000U)          /* ENH=0 ENL=0 */
#define PG_IOCON_LOW         (PG_IOCON_KEEP | 0x00003400U)          /* ENH=1 ENL=1 OVRDAT=01 (H=LOW, L=HIGH sink) */
#define PG_IOCON_FLOAT       (PG_IOCON_KEEP | 0x00003000U)          /* ENH=1 ENL=1 OVRDAT=00 (both LOW, high-Z) */

static inline uint32_t pgIoconWord(uint8_t mode)
{
    switch (mode)
    {
        case PHASE_PWM_ACTIVE: return PG_IOCON_PWM_ACTIVE;
        case PHASE_LOW:        return PG_IOCON_LOW;
        case PHASE_FLOAT:      return PG_IOCON_FLOAT;
        default:               return PG_IOCON_FLOAT;
    }
}

/**
 * @brief Apply a 6-step commutation pattern to PWM override registers.
 *
 * Writes PG1/PG2/PG3 IOCON atomically (single 32-bit SFR store each) to
 * minimise the window of intermediate invalid phase configurations during
 * sector changes. See PG_IOCON_* macros for the encoding.
 *
 * @param step Commutation step index 0-5
 */
void HAL_PWM_SetCommutationStep(uint8_t step)
{
    const COMMUTATION_STEP_T *s = &commutationTable[step];

    PG1IOCON = pgIoconWord(s->phaseA);
    PG2IOCON = pgIoconWord(s->phaseB);
    PG3IOCON = pgIoconWord(s->phaseC);
}

/**
 * @brief Set the PWM duty cycle on all three generators.
 * Only the active (PWM-driven) phase will produce output;
 * the other phases are held by override registers.
 *
 * @param duty Duty cycle in PWM clock counts
 */
void HAL_PWM_SetDutyCycle(uint32_t duty)
{
    if (duty < MIN_DUTY) duty = MIN_DUTY;
    if (duty > MAX_DUTY) duty = MAX_DUTY;

